randomCountry = [];
rndCountryPick = 0;
value = '';
activeQuestCard = [];
answeredCountries = [];
radio = [];
radioCheck = [];
nextStatusButton = false;
activeCard = 0;
randomCountryIndex = [];
country = 0;
capital = [];
tag = 0;
inputStatus = [];
radioCheck = [];
answeredCountry = [];
errors = [];
okButton = 0;
ajaxApi = [
 ['Андорра', 'Андорра-ла-Велья'],
 ['ОАЭ', 'Абу-Даби'],
 ['Афганистан', 'Кабул'],
 ['Антигуа и Барбуда', 'Сент-Джонс'],
 ['Ангилья', 'Валли'],
 ['Албания', 'Тирана'],
 ['Армения', 'Ереван'],
 ['Ангола', 'Луанда'],
 ['Аргентина', 'Буэнос-Айрес'],
 ['Австрия', 'Вена'],
 ['Австралия', 'Канберра'],
 ['Азербайджан', 'Баку'],
 ['Босния', 'Сараево'],
 ['Барбадос', 'Бриджтаун'],
 ['Бангладеш', 'Дакка'],
 ['Бельгия', 'Брюссель'],
 ['Буркина Фасо', 'Уагадугу'],
 ['Болгария', 'София'],
 /* ['Бахрейн', 'Манама'],
 ['Бурунди', 'Бужумбура'],
 ['Бенин', 'Порто-Ново'],
 ['Бермудские о-ва', 'Гамильтон'],
 ['Бруней', 'Бандар-Сери-Бегаван'],
 ['Боливия', 'Сукре'],
 ['Бразилия', 'Бразилиа'],
 ['Багамы', 'Нассау'],
 ['Бутан', 'Тхимпху'],
 ['Ботсвана', 'Габороне'],
 ['Беларусь', 'Минск'],
 ['Белиз', 'Бельмопан'],
 ['Канада', 'Оттава'],
 ['Демократическая Республика Конго', 'Киншаса'],
 ['Центральная Африканская Республика', 'Банги'],
 ['Швейцария', 'Берн'],
 ["Кот-д'Ивуар", 'Ямусукро'],
 ['Острова Кука', 'Аваруа'],
 ['Чили', 'Сантьяго'],
 ['Камерун', 'Яунде'],
 ['Китай', 'Пекин'],
 ['Колумбия', 'Богота'],
 ['Коста-Рика', 'Сан-Хосе'],
 ['Куба', 'Гавана'],
 ['Острова Зеленого Мыса', 'Прая'],
 ['Кипр', 'Никосия'],
 ['Чешская Республика', 'Прага'],
 ['Германия', 'Берлин'],
 ['Джибути', 'Джибути'],
 ['Дания', 'Копенгаген'],
 ['Доминиканская Республика', 'Санто-Доминго'],
 ['Алжир', 'Алжир'],
 ['Эквадор', 'Кито'],
 ['Эстония', 'Таллин'],
 ['Египет', 'Каир'],
 ['Западная Сахара', 'Эль-Аюн'],
 ['Эритрея', 'Асмэра'],
 ['Испания', 'Мадрид'],
 ['Эфиопия', 'Аддис-Абеба'],
 ['Финляндия', 'Хельсинки'],
 ['Фиджи', 'Сува'],
 ['Франция', 'Париж'],
 ['Габон', 'Либревиль'],
 ['Великобритания', 'Лондон'],
 ['Гренада', 'Сент-Джоржес'],
 ['Грузия', 'Тбилиси'],
 ['Французская Гвиана', 'Кайенна'],
 ['Гана', 'Аккра'],
 ['Гибралтар', 'Гибралтар'],
 ['Гренландия', 'Нуук'],
 ['Гамбия', 'Банжул'],
 ['Гвинея', 'Конакри'],
 ['Гваделупа', 'Бас-Тер'],
 ['Экваториальная Гвинея', 'Малабо'],
 ['Греция', 'Афины'],
 ['Гватемала', 'Гватемала'],
 ['Гуам', 'Аганья'],
 ['Гвинея-Биссау', 'Бисау'],
 ['Гайана', 'Джорджтаун'],
 ['Гонконг', 'Гонконг'],
 ['Гондурас', 'Тегусигальпа'],
 ['Хорватия', 'Загреб'],
 ['Гаити', 'Порт-о-Пренс'],
 ['Венгрия', 'Будапешт'],
 ['Индонезия', 'Джакарта'],
 ['Ирландия', 'Дублин'],
 ['Индия', 'Нью-Дели'],
 ['Ирак', 'Багдад'],
 ['Иран', 'Тегеран'],
 ['Исландия', 'Рейкьявик'],
 ['Италия', 'Рим'],
 ['Ямайка', 'Кингстон'],
 ['Иордания', 'Амман'],
 ['Япония', 'Токио'],
 ['Кения', 'Найроби'],
 ['Кыргызстан', 'Бишкек'],
 ['Камбоджа', 'Пномпень'],
 ['Кирибати', 'Южная Тарава'],
 ['Северная Корея', 'Пхеньян'],
 ['Южная Корея', 'Сеул'],
 ['Кувейт', 'Кувейт'],
 ['Каймановы Острова', 'Джоржтаун'],
 ['Казахстан', 'Астана'],
 ['Лаос', 'Вьентьян'],
 ['Ливан', 'Бейрут'],
 ['Лихтенштейн', 'Вадуц'],
 ['Шри-Ланка', 'Коломбо'],
 ['Либерия', 'Монровия'],
 ['Лесото', 'Масеру'],
 ['Литва', 'ВИЛЬНЮС'],
 ['Люксембург', 'Люксембург'],
 ['Латвия', 'Рига'],
 ['Ливия', 'Триполи'],
 ['Марокко', 'Рабат'],
 ['Монако', 'Монако'],
 ['Молдова', 'Кишинев'],
 ['Черногория', 'Подгорица'],
 ['Мадагаскар', 'Антананариву'],
 ['Македония', 'Скопье'],
 ['Мали', 'Бамако'],
 ['Мьянма', 'Нейпьидо'],
 ['Монголия', 'Улан-Батор'],
 ['Макао', 'Макао'],
 ['Мартиника', 'Форт-де-Франс'],
 ['Мавритания', 'Нуакшот'],
 ['Мальта', 'Валлетта'],
 ['Маврикий', 'Порт-Луи'],
 ['Мальдивские о-ва', 'Мале'],
 ['Малави', 'Лилонгве'],
 ['Мексика', 'Мехико'],
 ['Малайзия', 'Куала-Лумпур'],
 ['Мозамбик', 'Мапуту'],
 ['Намибия', 'Виндхук'],
 ['Новая Каледония', 'Нумеа'],
 ['Нигерия', 'Ниамей'],
 ['Нигерия', 'Абуджа'],
 ['Никарагуа', 'Манагуа'],
 ['Нидерланды', 'Амстердам'],
 ['Норвегия', 'Осло'],
 ['Непал', 'Катманду'],
 ['Новая Зеландия', 'Веллингтон'],
 ['Оман', 'Маскат'],
 ['Панама', 'Панама'],
 ['Перу', 'Лима'],
 ['Папуа – Новая Гвинея', 'Порт-Морсби'],
 ['Филиппины', 'Манила'],
 ['Пакистан', 'Исламабад'],
 ['Польша', 'Варшава'],
 ['Пуэрто-Рико', 'Сан-Хуан'],
 ['Португалия', 'Лиссабон'],
 ['Парагвай', 'Асунсьон'],
 ['Катар', 'Доха'],
 ['Румыния', 'Бухарест'],
 ['Сербия', 'Белград'],
 ['Россия', 'Москва'],
 ['Руанда', 'Кигали'],
 ['Саудовская Аравия', 'Эр-Рияд'],
 ['Соломонские острова', 'Хониара'],
 ['Сейшельские о-ва', 'Виктория'],
 ['Судан', 'Хартум'],
 ['Швеция', 'Стокгольм'],
 ['Сингапур', 'Сингапур'],
 ['Остров Святой Елены', 'Джеймстаун'],
 ['Словения', 'Любляна'],
 ['Словакия', 'Братислава'],
 ['Сьерра-Леоне', 'Фритаун'],
 ['Сан-Марино', 'Сан-Марино'],
 ['Сенегал', 'Дакар'],
 ['Сомали', 'Могадишу'],
 ['Суринам', 'Парамарибо'],
 ['Южный Судан', 'Джуба'],
 ['Сан-Томе и Принсипе', 'Сан-Томе'],
 ['Сальвадор', 'Сан-Сальвадор'],
 ['Сирийская Арабская Респ.', 'Дамаск'],
 ['Свазиленд', 'Мбабане'],
 ['Чад', 'Нджамена'],
 ['Того', 'Ломе'],
 ['Таиланд', 'Бангкок'],
 ['Таджикистан', 'Душанбе'],
 ['Восточный Тимор', 'Дили'],
 ['Туркменистан', 'Ашхабад'],
 ['Тунис', 'Тунис'],
 ['Тонга', 'Нукуалофа'],
 ['Турция', 'Анкара'],
 ['Тринидад и Тобаго', 'Порт-оф-Спейн'],
 ['Тайвань', 'Тайбэй'],
 ['Танзания', 'Додома'],
 ['Украина', 'Киев'],
 ['Уганда', 'Кампала'],
 ['США', 'Вашингтон'],
 ['Уругвай', 'Монтевидео'],
 ['Узбекистан', 'Ташкент'],
 ['Ватикан', 'Ватикан'],
 ['Венесуэла', 'Каракас'],
 ['Вьетнам', 'Ханой'],
 ['Вануату', 'Порт-Вила'],
 ['Самоа', 'Апиа'],
 ['Йемен', 'Сана'], */
 ['ЮАР', 'Претория'],
 ['Замбия', 'Лусака'],
 ['Зимбабве', 'Хараре'],
];

country = document.querySelector('h1');
capitals = document.querySelectorAll('.input');
radio = document.querySelectorAll('.form-control');
okButton = document.querySelector('#OK')
nextButton = document.querySelector('#next')
var countries = ajaxApi.slice();



startCard();

function startCard() {
 okButton.disabled = false;
 nextButton.disabled = true;
 country.style.color = 'rgb(0, 0, 0)'
 rndCountryPick = Math.round(Math.random() * 3);

 for (let i = 0; i < 4; i++) {
  radio[i].checked = false;
  radioCheck[i] = '';
  setRandomCountries(i);
 }
 setCardData();
}

function setRandomCountries(i) {
 randomCountryIndex[i] = (Math.round(Math.random() * (countries.length - 1)));

 if (answeredCountry.includes(randomCountryIndex[i]) == true || activeQuestCard.includes(countries[randomCountryIndex[i]][1].toUpperCase()) == true) {
  setRandomCountries(i);
 } else {
  activeQuestCard[i] = (countries[randomCountryIndex[i]][1].toUpperCase());
  randomCountry[i] = (countries[randomCountryIndex[i]][0]);

 }
}

function setCardData() {
 for (let i = 0; i < 4; i++) {
  country.innerHTML = randomCountry[rndCountryPick];
  capitals[i].innerHTML = activeQuestCard[i];
 }
}

function checkInput() {
 okButton.disabled = true;
 nextButton.disabled = false;

 answeredCountry.push([randomCountryIndex[rndCountryPick]][0]);
 console.log('answeredCountry: ', answeredCountry);

 for (let i = 0; i < 4; i++) {
  radioCheck[i] = radio[i].checked;
 }
 if (radioCheck[rndCountryPick] == true) {
  country.style.color = 'rgb(0, 255, 0)';

 } else {
  country.style.color = 'rgb(255, 0, 0)';
  errors.push([randomCountryIndex[rndCountryPick]][0]);
  console.log('errors: ', errors);
 }
};