let randomCountryPos = 0;
let activeQuestCard = [];
let randomCountryIndex = 0;
let errors = [];
let countries = [];
let countriesLength = 0;
let mode = 0;
let test = 0;
let countCard = 0;
let testData = [
   [
      ['Андорра', 'Андорра-ла-Велья'],
      ['ОАЭ', 'Абу-Даби'],
      ['Афганистан', 'Кабул'],
      ['Антигуа и Барбуда', 'Сент-Джонс'],
      ['Ангилья', 'Валли'],
      ['Албания', 'Тирана'],
      ['Армения', 'Ереван'],
      ['Ангола', 'Луанда'],
      ['Аргентина', 'Буэнос-Айрес'],
      ['Австрия', 'Вена'],
      ['Австралия', 'Канберра'],
      ['Азербайджан', 'Баку'],
      ['Босния', 'Сараево'],
      ['Барбадос', 'Бриджтаун'],
      ['Бангладеш', 'Дакка'],
      ['Бельгия', 'Брюссель'],
      ['Буркина Фасо', 'Уагадугу'],
      ['Болгария', 'София'],
      ['Бахрейн', 'Манама'],
      ['Бурунди', 'Бужумбура'],
      ['Бенин', 'Порто-Ново'],
      ['Бермудские о-ва', 'Гамильтон'],
      ['Бруней', 'Бандар-Сери-Бегаван'],
      ['Боливия', 'Сукре'],
      ['Бразилия', 'Бразилиа'],
      ['Багамы', 'Нассау'],
      ['Бутан', 'Тхимпху'],
      ['Ботсвана', 'Габороне'],
      ['Беларусь', 'Минск'],
      ['Белиз', 'Бельмопан'],
      ['Канада', 'Оттава'],
      ['Демократическая Республика Конго', 'Киншаса'],
      ['Центральная Африканская Республика', 'Банги'],
      ['Швейцария', 'Берн'],
      ["Кот-д'Ивуар", "Ямусукро"],
      ['Острова Кука', 'Аваруа'],
      ['Чили', 'Сантьяго'],
      ['Камерун', 'Яунде'],
      ['Китай', 'Пекин'],
      ['Колумбия', 'Богота'],
      ['Коста-Рика', 'Сан-Хосе'],
      ['Куба', 'Гавана'],
      ['Острова Зеленого Мыса', 'Прая'],
      ['Кипр', 'Никосия'],
      ['Чешская Республика', 'Прага'],
      ['Германия', 'Берлин'],
      ['Джибути', 'Джибути'],
      ['Дания', 'Копенгаген'],
      ['Доминиканская Республика', 'Санто-Доминго'],
      ['Алжир', 'Алжир'],
      ['Эквадор', 'Кито'],
      ['Эстония', 'Таллин'],
      ['Египет', 'Каир'],
      ['Западная Сахара', 'Эль-Аюн'],
      ['Эритрея', 'Асмэра'],
      ['Испания', 'Мадрид'],
      ['Эфиопия', 'Аддис-Абеба'],
      ['Финляндия', 'Хельсинки'],
      ['Фиджи', 'Сува'],
      ['Франция', 'Париж'],
      ['Габон', 'Либревиль'],
      ['Великобритания', 'Лондон'],
      ['Гренада', 'Сент-Джоржес'],
      ['Грузия', 'Тбилиси'],
      ['Французская Гвиана', 'Кайенна'],
      ['Гана', 'Аккра'],
      ['Гибралтар', 'Гибралтар'],
      ['Гренландия', 'Нуук'],
      ['Гамбия', 'Банжул'],
      ['Гвинея', 'Конакри'],
      ['Гваделупа', 'Бас-Тер'],
      ['Экваториальная Гвинея', 'Малабо'],
      ['Греция', 'Афины'],
      ['Гватемала', 'Гватемала'],
      ['Гуам', 'Аганья'],
      ['Гвинея-Биссау', 'Бисау'],
      ['Гайана', 'Джорджтаун'],
      ['Гонконг', 'Гонконг'],
      ['Гондурас', 'Тегусигальпа'],
      ['Хорватия', 'Загреб'],
      ['Гаити', 'Порт-о-Пренс'],
      ['Венгрия', 'Будапешт'],
      ['Индонезия', 'Джакарта'],
      ['Ирландия', 'Дублин'],
      ['Индия', 'Нью-Дели'],
      ['Ирак', 'Багдад'],
      ['Иран', 'Тегеран'],
      ['Исландия', 'Рейкьявик'],
      ['Италия', 'Рим'],
      ['Ямайка', 'Кингстон'],
      ['Иордания', 'Амман'],
      ['Япония', 'Токио'],
      ['Кения', 'Найроби'],
      ['Кыргызстан', 'Бишкек'],
      ['Камбоджа', 'Пномпень'],
      ['Кирибати', 'Южная Тарава'],
      ['Северная Корея', 'Пхеньян'],
      ['Южная Корея', 'Сеул'],
      ['Кувейт', 'Кувейт'],
      ['Каймановы Острова', 'Джоржтаун'],
      ['Казахстан', 'Астана'],
      ['Лаос', 'Вьентьян'],
      ['Ливан', 'Бейрут'],
      ['Лихтенштейн', 'Вадуц'],
      ['Шри-Ланка', 'Коломбо'],
      ['Либерия', 'Монровия'],
      ['Лесото', 'Масеру'],
      ['Литва', 'ВИЛЬНЮС'],
      ['Люксембург', 'Люксембург'],
      ['Латвия', 'Рига'],
      ['Ливия', 'Триполи'],
      ['Марокко', 'Рабат'],
      ['Монако', 'Монако'],
      ['Молдова', 'Кишинев'],
      ['Черногория', 'Подгорица'],
      ['Мадагаскар', 'Антананариву'],
      ['Македония', 'Скопье'],
      ['Мали', 'Бамако'],
      ['Мьянма', 'Нейпьидо'],
      ['Монголия', 'Улан-Батор'],
      ['Макао', 'Макао'],
      ['Мартиника', 'Форт-де-Франс'],
      ['Мавритания', 'Нуакшот'],
      ['Мальта', 'Валлетта'],
      ['Маврикий', 'Порт-Луи'],
      ['Мальдивские о-ва', 'Мале'],
      ['Малави', 'Лилонгве'],
      ['Мексика', 'Мехико'],
      ['Малайзия', 'Куала-Лумпур'],
      ['Мозамбик', 'Мапуту'],
      ['Намибия', 'Виндхук'],
      ['Новая Каледония', 'Нумеа'],
      ['Нигерия', 'Ниамей'],
      ['Нигерия', 'Абуджа'],
      ['Никарагуа', 'Манагуа'],
      ['Нидерланды', 'Амстердам'],
      ['Норвегия', 'Осло'],
      ['Непал', 'Катманду'],
      ['Новая Зеландия', 'Веллингтон'],
      ['Оман', 'Маскат'],
      ['Панама', 'Панама'],
      ['Перу', 'Лима'],
      ['Папуа – Новая Гвинея', 'Порт-Морсби'],
      ['Филиппины', 'Манила'],
      ['Пакистан', 'Исламабад'],
      ['Польша', 'Варшава'],
      ['Пуэрто-Рико', 'Сан-Хуан'],
      ['Португалия', 'Лиссабон'],
      ['Парагвай', 'Асунсьон'],
      ['Катар', 'Доха'],
      ['Румыния', 'Бухарест'],
      ['Сербия', 'Белград'],
      ['Россия', 'Москва'],
      ['Руанда', 'Кигали'],
      ['Саудовская Аравия', 'Эр-Рияд'],
      ['Соломонские острова', 'Хониара'],
      ['Сейшельские о-ва', 'Виктория'],
      ['Судан', 'Хартум'],
      ['Швеция', 'Стокгольм'],
      ['Сингапур', 'Сингапур'],
      ['Остров Святой Елены', 'Джеймстаун'],
      ['Словения', 'Любляна'],
      ['Словакия', 'Братислава'],
      ['Сьерра-Леоне', 'Фритаун'],
      ['Сан-Марино', 'Сан-Марино'],
      ['Сенегал', 'Дакар'],
      ['Сомали', 'Могадишу'],
      ['Суринам', 'Парамарибо'],
      ['Южный Судан', 'Джуба'],
      ['Сан-Томе и Принсипе', 'Сан-Томе'],
      ['Сальвадор', 'Сан-Сальвадор'],
      ['Сирийская Арабская Респ.', 'Дамаск'],
      ['Свазиленд', 'Мбабане'],
      ['Чад', 'Нджамена'],
      ['Того', 'Ломе'],
      ['Таиланд', 'Бангкок'],
      ['Таджикистан', 'Душанбе'],
      ['Восточный Тимор', 'Дили'],
      ['Туркменистан', 'Ашхабад'],
      ['Тунис', 'Тунис'],
      ['Тонга', 'Нукуалофа'],
      ['Турция', 'Анкара'],
      ['Тринидад и Тобаго', 'Порт-оф-Спейн'],
      ['Тайвань', 'Тайбэй'],
      ['Танзания', 'Додома'],
      ['Украина', 'Киев'],
      ['Уганда', 'Кампала'],
      ['США', 'Вашингтон'],
      ['Уругвай', 'Монтевидео'],
      ['Узбекистан', 'Ташкент'],
      ['Ватикан', 'Ватикан'],
      ['Венесуэла', 'Каракас'],
      ['Вьетнам', 'Ханой'],
      ['Вануату', 'Порт-Вила'],
      ['Самоа', 'Апиа'],
      ['Йемен', 'Сана'],
      ['ЮАР', 'Претория'],
      ['Замбия', 'Лусака'],
      ['Зимбабве', 'Хараре'],
   ],
   [
      ["Адыгея", "Майкоп"],
      ["Алтай", "Горно-Алтайск"],
      ["Башкортостан", "Уфа"],
      ["Бурятия", "Улан-Удэ"],
      ["Дагестан", "Махачкала"],
      ["Ингушетия", "Магас"],
      ["Кабардино-Балкария", "Нальчик"],
      ["Калмыкия", "Элиста"],
      ["Карачаево-Черкесия", "Черкесск"],
      ["Карелия", "Петрозаводск"],
      ["Коми", "Сыктывкар"],
      ["Крым", "Симферополь"],
      ["Марий Эл", "Йошкар-Ола"],
      ["Мордовия", "Саранск"],
      ["Саха (Якутия)", "Якутск"],
      ["Северная Осетия — Алания", "Владикавказ"],
      ["Татарстан", "Казань"],
      ["Тыва", "Кызыл"],
      ["Удмуртия", "Ижевск"],
      ["Хакасия", "Абакан"],
      ["Чечня", "Грозный"],
      ["Чувашия", "Чебоксары"],
      ["Алтайский край", "Барнаул"],
      ["Забайкальский край", "Чита"],
      ["Камчатский край", "Петропавловск-Камчатский"],
      ["Краснодарский край", "Краснодар"],
      ["Красноярский край", "Красноярск"],
      ["Пермский край", "Пермь"],
      ["Приморский край", "Владивосток"],
      ["Ставропольский край", "Ставрополь"],
      ["Хабаровский край", "Хабаровск"],
      ["Амурская область", "Благовещенск"],
      ["Архангельская область", "Архангельск"],
      ["Астраханская область", "Астрахань"],
      ["Белгородская область", "Белгород"],
      ["Брянская область", "Брянск"],
      ["Владимирская область", "Владимир"],
      ["Волгоградская область", "Волгоград"],
      ["Вологодская область", "Вологда"],
      ["Воронежская область", "Воронеж"],
      ["Ивановская область", "Иваново"],
      ["Иркутская область", "Иркутск"],
      ["Калининградская область", "Калининград"],
      ["Калужская область", "Калуга"],
      ["Кемеровская область", "Кемерово"],
      ["Кировская область", "Киров"],
      ["Костромская область", "Кострома"],
      ["Курганская область", "Курган"],
      ["Курская область", "Курск"],
      ["Ленинградская область", "Санкт-Петербург[7]"],
      ["Липецкая область", "Липецк"],
      ["Магаданская область", "Магадан"],
      ["Московская область", "Москва[8]"],
      ["Мурманская область", "Мурманск"],
      ["Нижегородская область", "Нижний Новгород"],
      ["Новгородская область", "Великий Новгород"],
      ["Новосибирская область", "Новосибирск"],
      ["Омская область", "Омск"],
      ["Оренбургская область", "Оренбург"],
      ["Орловская область", "Орёл"],
      ["Пензенская область", "Пенза"],
      ["Псковская область", "Псков"],
      ["Ростовская область", "Ростов-на-Дону"],
      ["Рязанская область", "Рязань"],
      ["Самарская область", "Самара"],
      ["Саратовская область", "Саратов"],
      ["Сахалинская область", "Южно-Сахалинск"],
      ["Свердловская область", "Екатеринбург"],
      ["Смоленская область", "Смоленск"],
      ["Тамбовская область", "Тамбов"],
      ["Тверская область", "Тверь"],
      ["Томская область", "Томск"],
      ["Тульская область", "Тула"],
      ["Тюменская область", "Тюмень"],
      ["Ульяновская область", "Ульяновск"],
      ["Челябинская область", "Челябинск"],
      ["Ярославская область", "Ярославль"],
      ["Москва", "Москва"],
      ["Санкт-Петербург", "Санкт-Петербург"],
      ["Севастополь", "Севастополь"],
      ["Еврейская АО", "Биробиджан"],
      ["Ненецкий АО", "Нарьян-Мар"],
      ["Ханты-Мансийский АО — Югра", "Ханты-Мансийск"],
      ["Чукотский", "Анадырь"],
      ["Ямало-Ненецкий", "Салехард"],
   ],
   [
      ["Айдахо", "Бойсе"],
      ["Айова", "Де-Мойн"],
      ["Алабама", "Монтгомери"],
      ["Аляска", "Джуно"],
      ["Аризона", "Финикс"],
      ["Арканзас", "Литл-рок"],
      ["Вайоминг", "Шайен"],
      ["Вашингтон", "Олимпия"],
      ["Вермонт", "Монтпилиер"],
      ["Виргиния", "Ричмонд"],
      ["Виргиния Западная", "Чарлстон"],
      ["Висконсин", "Мэдисон"],
      ["Гавайи", "Гонолулу"],
      ["Дакота Северная", "Бисмарк"],
      ["Дакота Южная", "Пирр"],
      ["Делавэр", "Довер"],
      ["Джорджия", "Атланта"],
      ["Иллинойс", "Спрингфилд"],
      ["Индиана", "Индианаполис"],
      ["Калифорния", "Сакраменто"],
      ["Канзас", "Топика"],
      ["Каролина Северная", "Роли"],
      ["Каролина Южная", "Колумбия"],
      ["Кентукки", "Франкфорт"],
      ["Колорадо", "Денвер"],
      ["Коннектикут", "Хартфорд"],
      ["Луизиана", "Батон-Руж"],
      ["Массачусетс", "Бостон"],
      ["Миннесота", "Сен-Пол"],
      ["Миссисипи", " Джэксон"],
      ["Миссури", "Джефферсон-Сити"],
      ["Мичиган", "Лансинг"],
      ["Монтана", "Хелена"],
      ["Мэн", "Огаста"],
      ["Мэриленд", "Аннаполис"],
      ["Небраска", "Линкольн"],
      ["Невада", "Карсон-Сити"],
      ["Нью-Гэмпшир", "Конкорд"],
      ["Нью-Джерси", "Трентон"],
      ["Нью-Йорк", "Олбани"],
      ["Нью-Мексико", "Санта-Фе"],
      ["Огайо", "Колумбус"],
      ["Округ Колумбия", "Вашингтон"],
      ["Оклахома", "Оклахома-сити"],
      ["Орегон", "Сейлем"],
      ["Пенсильвания", "Гаррисберг"],
      ["Род-Айленд", "Провиденс"],
      ["Теннеси", "Нэшвилл"],
      ["Техас", "Остин"],
      ["Флорида", "Таллахасси"],
      ["Юта", "Солт-Лейк-Сити"],
   ]
];

let country = document.querySelector('#country');
let capitals = document.querySelectorAll('.input');
let count = document.querySelector('#count');
let startTest = document.querySelector('#startTest');
let startMode = document.querySelector('#startMode');
let start = document.querySelector('#start');
let main = document.querySelector('#main');
let result = document.querySelector('#result');
let next = document.querySelector('#next');
let res1 = document.querySelector('#res1');
let res2 = document.querySelector('#res2');
let res3 = document.querySelector('#res3');
let correct = document.querySelector('#correct');

function setRandomCapitals(i) {
   let randomCapital = Math.round(Math.random() * (testData[test].length - 1));
   if (i === randomCountryPos) {
      activeQuestCard[i] = countries[randomCountryIndex];
   } else {
      if ((activeQuestCard.includes(randomCapital) === true) ||
         randomCapital === countries[randomCountryIndex]) {
         setRandomCapitals(i);
      } else {
         activeQuestCard[i] = randomCapital;
      }
   }
}

function startCard() {
   count.innerHTML = (countCard + 1) + '  из  ' + countriesLength;
   countCard += 1;
   next.style.display = 'none';
   randomCountryPos = parseInt(Math.round(Math.random() * 3));
   randomCountryIndex = (Math.round(Math.random() * (countries.length - 1)));
   country.innerHTML = testData[test][countries[randomCountryIndex]][mode];
   for (let i = 0; i < 4; i += 1) {
      setRandomCapitals(i);
      capitals[i].disabled = false;
      capitals[i].className = "form-control input";
      capitals[i].innerHTML = testData[test][activeQuestCard[i]][(-(mode - 1))];
   }
}

function checkInput(value) {
   let checkValue = parseInt(value);
   for (let i = 0; i < 4; i += 1) {
      capitals[i].disabled = true;
   }
   if (checkValue === randomCountryPos) {
      capitals[checkValue].className = "form-control input is-valid";
   } else {
      capitals[randomCountryPos].className = "form-control input is-valid";
      capitals[checkValue].className = "form-control input is-invalid";
      errors.push(countries[randomCountryIndex]);
   }
   countries.splice(randomCountryIndex, 1);
   next.style.display = 'block';
}

function getFinalResult() {
   next.style.display = 'none';
   main.style.display = 'none';
   result.style.display = 'block';
   if (errors.length === 0) {
      correct.style.display = 'none';
   }
   res1.innerHTML = 'Верно:     ' + (countriesLength - errors.length);
   res2.innerHTML = 'Не верно:  ' + errors.length;
   res3.innerHTML = 'Всего:     ' + countriesLength;
}

function startNew() {
   location.reload();
}

chooseTest = function (value) {
   test = value;
   for (let i = 0; i < testData[test].length; i += 1) {
      countries.push(i);
   }
   countriesLength = countries.length;
   startTest.style.display = 'none';
   startMode.style.display = 'block';
};

chooseMode = function (value) {
   mode = value;
   startMode.style.display = 'none';
   main.style.display = 'block';
   startCard();
};

correctErrors = function () {
   countCard = 0;
   result.style.display = 'none';
   main.style.display = 'block';
   countries.splice(0, countries.length);
   activeQuestCard.splice(0, activeQuestCard.length);
   countries = errors.slice();
   countriesLength = countries.length;
   errors.splice(0, errors.length);
   nextButton();
};

nextButton = function () {
   if (countCard === countriesLength) {
      setTimeout(() => getFinalResult(), 400);
   } else {
      startCard();
   }
};